{
  "movements": [
    {
      "name": "Chest Stretch",
      "targets": "Pectoralis Major/Minor",
      "type":"Stretch",
      "description": "Other than facilitating pushing motions, the Pectoralis Muscles (or Chest Muscles), works to rotate the upper arm (humerus) inwards. Having overly-tight Pectorals can cause the shoulders to round over, which is not only an aesthetic concern, but it can contribute to a host of health complications if left unchecked. Excessively tight Pectorals can possibly be counteracted by stretching the muscles in question, in conjunction with strengthening their antagonistic muscles. Strengthening the Posterior Deltoid muscle can help to pull the shoulders back, and exercises such as the Prone Cobra or Wall Isometric Hold may work to improve external rotation of the upper arm.",
      "steps":["- Place your hand and forearm against a wall, door frame, or other object, with your elbow roughly in line with your shoulder.",
        "- With your hand firmly against the wall, begin to twist your body away from your hand, until you begin to feel a light stretch in the Chest region.",
        "- You may also perform this stretch on both sides of the Chest simultaneously, by performing the stretch in the corner of a room.",
        "Suggested Application: Perform this stretch for roughly 30 Seconds or 5 steady breaths per side (or total if using the two arm variation).",
        "*I have found that this Stretch compliments well with the Wall Isometric Hold to open up the Chest and alleviate rounded shoulders. Mileage may vary per individual.",
        "*Try changing the elevation of your forearm to stretch the Pectorals from various angles."],
      "thumbnailResId":"ic_chest_stretch",
      "imageResId":["im_chest_stretch_side", "im_chest_stretch_corner"]
    },
    {
      "name": "Bicep Stretch",
      "targets": "Biceps, Forearms",
      "type":"Stretch",
      "description": "Excessively tight Biceps probably won't be your biggest concern in terms of postural ailments. That being said, I wanted to include this stretch as I've found that excessively tight Biceps contributes to my shoulders rounding over; not to mention it makes my arms look bowed.  ",
      "steps":["- Hold your arm outstretched, at roughly 90 degrees to your torso.",
        "- Turn your arm over, such that your fingers are pointing towards the ground, and place your hand flat against a wall.",
        "- While keeping your palm flat against the wall, begin to turn your body away from the wall, until you feel a light stretch in the Biceps and/or Forearms.",
        "Suggested Application: Perform this stretch for roughly 30 Seconds or 5 steady breaths per side.",
        "*Cease this stretch immediately, if you feel ANY pain or pressure in the elbow joint."] ,
      "thumbnailResId":"ic_bicep_stretch",
      "imageResId":["im_bicep_stretch"]

    },
    {
      "name": "Neck Stretch",
      "targets": "Neck, Upper Back",
      "type":"Stretch",
      "description": "Forward head posture, or Programmer posture as I've taken to calling it, is a very common ailment for those who spent excessive amounts of time hunched over a desk. Personally, I also seem to carry plenty of tension in my neck and upper back, exacerbating the issue further. I've read plenty of articles which explain how one should best sit at their computer desk, but let's be honest here; when you're under a deadline which requires you to glue yourself to a chair for 8-12 hours at a time, there's a pretty good chance that you're posture will start to break down at some point. Although stretching the muscles in the rear of your neck alone won't correct the issue, it makes for an excellent compliment to exercises like the Wall Isometric Hold. I strongly suggest performing this stretch prior, as I've found that without it, the back of my head often can't even reach the wall.",
      "steps":["- While standing or sitting, place a hand on the opposite side of the back of your head.",
        "- Without hunching, begin to lightly pull your head down and/or to the side, until you feel a light stretch in the neck, and the upper Trapezius region.",
        "*I have found this stretch compliments well with the Wall Isometric Hold to alleviate Forward Head Posture.",
        "Suggested Application: Perform this stretch for roughly 30 Seconds or 5 steady breaths per side. I suggest finding and holding the stretch in at least two angles each side.",
        "*Do not use Excessive pressure at any point! Vary the angle to which you pull your head to find the appropriate muscles."],
      "thumbnailResId":"ic_neck_stretch",
      "imageResId":["im_neck_stretch_front", "im_neck_stretch_side"]
    },
    {
      "name": "Hip Flexor Stretch",
      "targets": "Hip Flexors, Quadriceps",
      "type":"Stretch",
      "description": "One of the most common ailments of excessive sitting, is the shortening of a series of muscles commonly called the Hip Flexors. This can lead to many complications, both in terms of physical health (lower back pain), and aesthetic concerns (pot belly). Using this stretch in conjunction with exercises which activate and strengthen the Hamstrings and Gluteus muscles, can help to pull the pelvis into better alignment. I frequently perform the Lying Hip Raise directly after this stretch, particularly if my lower back is feeling tight.",
      "steps":["- While kneeling on one leg, place the other leg in front of you with both knees bent at roughly 90 degree angles.",
        "- Stand up straight, and lean slightly in front of you, until you begin to feel a light stretch in the Hip and Quad regions.",
        "- Do your best to contract your Gluteus Muscle on the side which your Hip Flexors are being stretched.",
        "Suggested Application: Perform this stretch for roughly 30 Seconds or 5 steady breaths per side. If one side is particularly tight, do not be afraid to spending extra time on it.",
        "*Performing this stretch for the first few times can be quite a shock if you've never stretched your Hip Flexors.",
        "*I have found this stretch compliments well with the Lying Hip Raise exercise, to alleviate sore hips and lower back after extended periods of sitting."],
      "thumbnailResId":"ic_hip_flexor_stretch",
      "imageResId":["im_hip_flexor_stretch_front","im_hip_flexor_stretch_side"]
    },
    {
      "name": "Couch Stretch",
      "targets": "Hip Flexors, Quadriceps",
      "type":"Stretch",
      "description": "Popularized by Kelly Starrett, this powerful stretch opens up the Hips and stretches the Quadriceps. Although it isn't an entirely fair comparison, I think of the Couch Stretch as a more advanced version of the Hip Flexor Stretch, and strongly suggest that you become comfortable with the latter before attempting the former. As with the Hip Flexor Stretch, I recommend following this stretch up with an exercise which activates the Hamstrings and Gluteus muscles. ",
      "steps":["- While kneeling on all fours beside a wall, place one leg up against the wall.",
        "- Your shin and the front of your foot should be making contact with the wall.",
        "- While placing much of your weight on your arms, attempt to place your other leg flat footed on the ground.",
        "- As with the Hip Flexor stretch, do your best to contract your Gluteus muscle on the side being stretched.",
        "Suggested Application: Perform this stretch for roughly 30 Seconds or 5 steady breaths per side. If one side is particularly tight, do not be afraid to spending extra time on it.",
        "*This is an advanced stretch for most people. I STRONGLY suggest that you become comfortable with the Hip Flexor Stretch before even attempting this stretch, lest you do serious damage to your Hip Flexors.",
        "*Do not be surprised if contract your Gluteus Muscle isn't possible; Work towards it."],
      "thumbnailResId":"ic_couch_stretch",
      "imageResId":["im_couch_stretch_front", "im_couch_stretch_side"]
    },
    {
      "name": "Wall Iso. Hold",
      "targets": "Neck, Shoulders, Back",
      "type":"Exercise",
      "description": "This magical exercise combines the effects of pulling the neck and head into proper alignment, with external rotation of the humerus, thereby helping to alleviate rounded shoulders. I've found that stretching my Biceps, Chest, and Neck muscles, directly prior to performing the exercise, makes a night and day difference with my posture. ",
      "steps":["- Place your body flat against a wall, ideally with your heels, posterior, upper back making contact.",
        "- Outstretch yours arms an attempt to place the back of your hands flat against the wall.",
        "- While keeping your chin pulled tucked, and maintaining all other points of contact, attempt to place the back of your head against the wall.",
        "- Try to lengthen your spine, as if someone is measuring your height and you're trying to squeeze out an extra Centimetre.",
        "Suggested Application: I strongly suggest performing the Chest and Neck stretches prior to this Exercise, to maximize the benefits. I prefer to hold this position for roughly 90 seconds, or 10 steady and deep breaths.",
        "*Gratz, you're now a Starfish.",
        "*Don't be afraid to press the back of your head against the wall with some force. You may begin to feel your front neck muscles, and some muscles in your mid back activating. That's a good sign."],
      "thumbnailResId":"ic_wall_stretch",
      "imageResId":["im_wall_stretch"]
    },
    {
      "name": "Lying Hip Raise",
      "targets": "Hamstrings, Gluteus",
      "type":"Exercise",
      "description": "This exercise works to activate and (depending on how weak they are), strengthen the Hamstrings and Gluteus muscles. This can help to pull the pelvis back into proper alignment when used in conjunction with appropriate stretches, and I've found it to alleviate lower back strain from excessive sitting. Be aware that you may get some funny looks when you perform this exercise in public. ",
      "steps":["- Lay down on the ground, and pull your legs in until your Calves are touching (or close to) your Hamstrings, feet flat on the ground.",
        "- Pretend you're suddenly in a Rap video, and thrust your hips forward, until you feel a good contraction in the Gluteus muscles.",
        "- Hold the contracted position for a second or two, and then lower back down.",
        "Suggested Application: I strongly suggest performing either the Hip Flexor or Couch Stretch to maximize the benefit of this Exercise. Perform 8-12 Repetitions, holding the contraction at the top for every Rep.",
        "*The goal of this Exercise is to activate the Glutes and Hamstrings. The more you are able to feel the muscle contractions, the more benefit you'll see.",
        "*If you have incredibly to Hamstrings, I would suggest stretching them prior to this Exercise to avoid them pulling.",
        "*If you wish to activate the Hamstrings more, imagine that you are trying to pull the floor towards you with your feet (without actually moving your feet)."],
      "thumbnailResId":"ic_glute_ham_raise",
      "imageResId":["im_hip_raise_side_relaxed", "im_hip_raise_side"]
    },
    {
      "name": "Prone Cobra",
      "targets": "Shoulders, Back",
      "type":"Exercise",
      "description": "The Prone Cobra is a great compound exercise to strengthen the upper back and encourage external rotation of the shoulders. I prefer to stretch the Chest and Biceps muscles prior to performing this exercise.",
      "steps":["- Lay face down on the ground, arms at your side.",
        "- While keeping a neutral spine, with your chin somewhat tucked in, attempt to lift your Torso off of the ground.",
        "- Without twisting your wrists, externally rotate your arms like you are trying to point your thumbs to the roof.",
        "- You should begin to feel the muscles in your upper back and rear shoulders activating in order to maintain this position.",
        "Suggested Application: Maintain the position for roughly 30-90 Seconds, or 5-10 steady breaths total. Do not be afraid to work up to a total by dividing the time into several sets (3 sets of 30 seconds for example)."],
      "thumbnailResId":"ic_prone_cobra",
      "imageResId":["im_prone_cobra"]
    },
    {
      "name": "Abdominal Vacuum",
      "targets": "Core, Pelvic Floor",
      "type":"Exercise",
      "description": "When we think Abdominal Muscles, most of us immediately think of the Six Pack muscles. However, the bumpy protrusions in front of our stomach are only one portion of our core muscles. Humans have a built in Girdle known as the transverse abdominal muscle, which helps to maintain intra abdominal pressure and keep the lower spine in a healthy position. It is also widely claimed that this exercise can help to pull the gut in, alleviating pot belly syndrome.",
      "steps":["- While kneeling on all fours, take a big breath in.",
        "- Exhale, completely, really forcing the air out.",
        "- As you exhale, and after, attempt to pull your navel into your spine, and clench the muscles in your pelvic floor (like you're trying to hold back a bowel movement. Sorry for the image, but how else can I explain it?)",
        "- Maintain muscular tension for a time, and then inhale and release muscular tension.",
        "- Between each held breath, take one or two normal breaths so you don't starve your brain of oxygen.",
        "Suggested Application: I would suggest performing 8-12 repetitions, holding for 8-16 seconds.",
        "*Some people advocate for holding repetitions for longer durations, but I like my brain  to have plenty of Oxygen thank you :-)."],
      "thumbnailResId":"ic_ab_vacuum",
      "imageResId":["im_ab_vacuum_relaxed", "im_ab_vacuum_tensed"]
    }
  ]
}